distribution/examples/versioning/xslt/request_v11.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://predic8.com/contactService/v11">
   <soapenv:Header/>
   <soapenv:Body>
      <con:addContact>
         <firstname>John</firstname>
         <lastname>Doe</lastname>
      </con:addContact>
   </soapenv:Body>
</soapenv:Envelope>
